In [24]:
import numpy as np
import pandas as pd

obj=pd.Series([4.5, 7.2, -5.3, 3.6],index=['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [25]:
obj2 = obj.reindex(['a', 'b', 'c', 'd'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
dtype: float64

In [26]:
obj3 = pd.Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
obj3.reindex(range(6),method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [27]:
frame = pd.DataFrame(np.arange(9).reshape(3,3),
                    index = ['a', 'c', 'd'],
                    columns = ['台北', '台中', '高雄'])
frame

   台北  台中  高雄
a   0   1   2
c   3   4   5
d   6   7   8

In [28]:
#dataFrame使用reindex
frame.reindex(['a', 'd' , 'c'])

   台北  台中  高雄
a   0   1   2
d   6   7   8
c   3   4   5

In [29]:
frame.reindex(['a','c'])

   台北  台中  高雄
a   0   1   2
c   3   4   5

In [30]:
frame

   台北  台中  高雄
a   0   1   2
c   3   4   5
d   6   7   8

In [31]:
frame.reindex(['a', 'c'],columns=['台北','高雄', '台南'])

    台北   高雄  台南
a  0.0  2.0 NaN
c  3.0  5.0 NaN

In [32]:
obj = pd.Series(np.arange(5.),index=['a', 'b', 'c', 'd', 'e'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [33]:
obj.drop('c')

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [34]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [35]:
obj.drop(['c', 'd'])

a    0.0
b    1.0
e    4.0
dtype: float64

In [36]:
data = pd.DataFrame(np.arange(16).reshape(4,4),
                   index=['台北','台中', '台南', '高雄'],
                   columns=['one', 'two', 'three', 'four'])
data

    one  two  three  four
台北    0    1      2     3
台中    4    5      6     7
台南    8    9     10    11
高雄   12   13     14    15

In [37]:
data.drop(['台北','台中'])

    one  two  three  four
台南    8    9     10    11
高雄   12   13     14    15

In [38]:
data

    one  two  three  four
台北    0    1      2     3
台中    4    5      6     7
台南    8    9     10    11
高雄   12   13     14    15

In [39]:
data.drop(['one', 'two'],inplace=True,axis=1)

In [40]:
data

    three  four
台北      2     3
台中      6     7
台南     10    11
高雄     14    15